---
kind: enumMember
id: F:Autodesk.Revit.DB.CompoundStructureError.VerticalUnusedLayer
enum: Autodesk.Revit.DB.CompoundStructureError
source: html/8e8457e0-84c4-ccb1-114c-fa25a6d37fed.htm
---
# Autodesk.Revit.DB.CompoundStructureError.VerticalUnusedLayer

A layer is not membrane layer and the Thickness of layer is zero.